УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_КатегорииДолжников/УПЖКХ_КатегорииДолжников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_КатегорииДолжников</name>
  <attributes>
    <name>ПереченьМероприятийСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоПериоду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоПериодуОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоПериодуДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоСумме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоСуммеОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоСуммеДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_КатегорииДолжников/ObjectModule.bsl
#Область ОбработчикиСобытийСправочника

// Обработчик события "ОбработкаПроверкиЗаполнения" объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	Если СокрЛП(Наименование) = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Наименование";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Не заполнено наименование категории должников.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ПоПериоду И ПоПериодуОт = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ПоПериодуОт";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Не заполнено начальное количество месяцев.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ПоСумме И ПоСуммеОт = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ПоСуммеОт";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Не заполнена начальная сумма задолженности.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;

	Если НЕ ПоПериоду И Не ПоСумме Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ПоПериоду";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Не указаны условия отбора по категории.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ПоПериодуДо > 0 И ПоПериодуОт > ПоПериодуДо Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ПоПериодуДо";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Неверно указан интервал по периоду.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ПоСуммеДо > 0 И ПоСуммеОт > ПоСуммеДо Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "ПоСуммеДо";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = "Неверно указан интервал по сумме.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ПоПериоду Тогда
		ПоПериодуОт = 0;
		ПоПериодуДо = 0;
	КонецЕсли;
	
	Если НЕ ПоСумме Тогда
		ПоСуммеОт = 0;
		ПоСуммеДо = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
